{
  "title": "Detroit Style Pizza Dough",
  "oven": "S",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "All Purpose Flour"
    },
    "water": {
      "bakers": "63",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.3900",
      "recommended": "-No Yeast Needed"
    },
    "salt": {
      "bakers": "2.20",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "0.00",
      "recommended": "Extra Virgin Olive Oil"
    },
    "sugar": {
      "bakers": "2.00",
      "recommended": "Refined Granulated Sugar"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,3783.msg31493.html#msg31493",
  "recipe": "<p>Add the yeast to the flour in a bowl and stir.  Put the water into the bowl of the stand mixer, add the salt and sugar. Stir for about a minute to dissolve the salt &amp; sugar in the water. Using the stir speed of the mixer, gradually add the flour mixture to the water mixture. Once the flour has been taken up by the water and has formed a rough dough ball, add the oil and knead that in, at the stir speed until it has been fully incorporated into the dough. Once the dough has incorporated the oil, continue kneading the dough, at 1 or 2 speed, until the dough takes on a smooth texture and consistency and is elastic, about 5 minutes. It should be a bit tacky--not wet or dry.  It may be necessary to add a bit more flour or a bit more water to achieve the desired finished condition. Once the dough looks right, remove it from the mixer bowl and knead it by hand for about 30 seconds to a minute. If the dough feels a little bit sticky at this point, the final hand kneading will usually cause the stickiness to disappear, so don't be tempted to overcome it by adding more flour. Refrigerate for 24 hrs or up to 48 hrs in an oiled container.<br/> <br/> Remove the dough from the refrigerator and allow to rest for one hour. Shape and stretch it out to 13 inches and fit into the pan coated with 1 or 2 tablespoons of olive oil. Push the dough out to the edge of the pan, without forming a rim. Cover the panned dough and proof for an additional 2 hours.<br/> <br/> After the dough has proofed and just about doubled in volume, dollop some sauce on top, add the cheese being sure to push the cheese out to the edge, top it. Bake on a pizza stone that has been placed on the lowest oven rack position and preheated for about an hour at 500 degrees F. Bake for about 10-11 minutes.<br/> </p> "
}
