{
  "title": "TXCraig's Neapolitan Pizza Dough",
  "oven": "W",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "Caputo 00 Pizzeria"
    },
    "water": {
      "bakers": "62",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "1.7000",
      "recommended": "Natural Leaven "
    },
    "salt": {
      "bakers": "2.80",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "0.00",
      "recommended": "-No Oils Needed"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,20477.msg202047.html#msg202047",
  "recipe": "<p>100% Caputo (my typical batch is ~1.3kg flour)<br/> 62.5% Water at about 40-45F (play with this over time in a range of 60-64%)<br/> 3.0% Salt (I would not go lower than 2.5% or more than maybe 3.1%)<br/> 1.3% Ischia Culture (fully active) NO FRESH YEAST, IDY, or ADY!!! Trust your culture. The hydration and flour you use in your culture don’t matter much at quantities this low.  I’m probably a little stiffer than 100%, but I doubt it is significant.<br/> <br/> 1) Dissolve the salt in the water.<br/> 2) Mix in the culture until it’s pretty well dissolved. I use a hand whisk and froth it up some too.<br/> 3) Quickly add about 2/3 of the flour and mix (I use a KitchenAid K5SS) until basically homogeneous. I use the dough hook in my hand to get all the flour wet quickly, and then I put it on the mixer.<br/> 4) Add the remaining 1/3 of the flour evenly over the next 5 minutes or so allowing each addition to become incorporated before adding the next bit.<br/> 5) Mix until generally smooth and homogenous. It won’t get completely smooth and silky yet. It will still have a bit of a rough look when you stop the mixer. It’s going to feel somewhat tacky and rather soft.<br/> 6) Dump it onto a counter, give it 20 or so kneads until it is fairly stiff, cover with plastic or a bowl, and let it rest for 7-10 minutes. In the summer, I put it on a plate and let it rest (covered) in the fridge.<br/> 7) It will have relaxed noticeably. Stretch and fold it 4 or 5 times. Watch this video if you don’t know what I mean by stretch and fold: http://www.gourmet.com/magazine/video/2008/03/bertinet_sweetdough.  It will get stiff again and get some tears on the surface. Cover and let it rest again for another 7-10 minutes. Remember to try to capture air in the dough as you do your stretch and folds.<br/> 8] Give it a few more stretch and folds. If it is now silky smooth, you’re done. If not, give it one more rest and a few more stretch-and-folds, and you should be good to go.<br/> 9) Put it in a container and let it ferment in bulk for 24 hours at ~65F. Ideally, you will see virtually no rise after 24 hours. You should maybe start to see some tiny little bubbles forming. This is how I do my bulk ferment: http://www.pizzamaking.com/forum/index.php/topic,18509.msg179991.html#msg179991<br/> 10) Ball the dough (make them tight without tearing the skin) and let ferment another 20-24 hours. I use lightly oiled individual Rubbermaid tubs. I use 250g balls for a 13” pizza. If you want a very large cornice, use 275g.<br/> <br/> Dough trays are fine too but a little touchier as the balls will come together and will need to be cut apart and lifted out with a scraper. With the lightly oiled tubs, the dough ball just rolls right out onto your flour pile. Start the ball fermentation at ~65F in the same set-up you use for your bulk. After 12 hours, you’ll have to pay attention to what is going on and either keep it at 65F or let it warm as high as 78F or so to get the balls ready when you want them ready.<br/> <br/> After doing it a couple times, you get a handle on how changes in temperature affect activity. It can be quite variable. Sometime I need to keep the balls at 65F for almost the entire time. Sometimes the last 10 hours or so may be 78F. Ideally, at least the last couple hours will be at 78F or so. You get a little better oven rise performance when the dough is warmer (though leoparding may be better when the dough is cooler).  More times than not, I end up keeping my dough balls at 65F or so for about 18 hours and then bring them up to 78F for the final 4+ hours. If you want a temperature between 65F and 78F, open the door of the cooler but leave the ice block in there. If you really need to slow things down, stick the balls in the fridge for 15-20 minutes or so. You may have to do this several times. Don’t go longer. You really don’t want the dough to get too cold especially if it is close to the time you want to bake it.<br/> <br/> Your culture, how active it is, temperature and temperature stability will all affect things. So will hydration and salinity if you vary them. You really need to experiment some to dial things in exactly where you want them and to understand what adjustments you need to make as environmental conditions change.<br/> <br/> </p> "
}
