{
  "title": "Pete-zza's Papa John's Clone Pizza",
  "oven": "S",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "King Arthur Bread Flour"
    },
    "water": {
      "bakers": "56",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.1400",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "1.75",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "7.00",
      "recommended": "Vegetable Oil"
    },
    "sugar": {
      "bakers": "4.00",
      "recommended": "Sugar"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,6758.0.html",
  "recipe": "<p>Add water (at a temperature of 55 degrees F) to the mixer bowl of an electic stand mixer.  Add the salt and sugar to the water and stir to fully dissolve, about one minute. Add the oil to the mixer bowl, followed by all of the flour. Use the mixer's flat beater attachment to combine all of the ingredients in the mixer bowl, at stir/speed 1, for about a minute, or until the dough mass pulls away from the sides of the mixer bowl and collects around the flat beater. There should be no raw flour left in the bowl. Scrape the dough off of the flat beater (it should be shaggy and on the sticky side) and switch to the C-hook attachment. Knead the dough at stir speed, for about 2 minutes, or just until the dough gathered around the dough hook in a fairly cohesive, but still somewhat wet and sticky, mass.<br/> <br/> Sprinkle the yeast over the dough mass in the mixer bowl. Mix the dough for about 5-6 minutes at speed 2. Turn the dough out onto a cutting board and form into as many round balls as you plan to make into pizzas.  Lightly oil each dough ball and place it in an oiled container with a cover (e.g., a 1-quart glass Pyrex bowl with plastic lid) and place the bowl in the refrigerator. Leave the dough in the refrigerator for five days. During the first two days, there should be little noticeable expansion of the dough. The dough will be optimal for use after about five days, but it could be used at after three days and up to eight days in the refrigerator.  <br/> <br/> Upon removal from the refrigerator, let the dough warm up at room temperature (about 80 degrees F) for about an hour. Open the dough ball to about 10”. Dock the dough with a dough docker.  For maximum authenticity, make a cloned version of Papa John's Dustinator flour blend as follows:  combine semolina flour, white flour, and soybean oil (a few few drops worked into the flours). <br/> <br/> For more detailed instructions on making the Papa John's style pizza, see the Pete-zza's Papa John's Clone thread at the link shown below.  <br/> <br/> </p> "
}
