{
  "title": "Vera Pizza Napolitana Dough Recipe",
  "oven": "W",
  "style": "N",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "Caputo 00 Pizzeria"
    },
    "water": {
      "bakers": "60",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.1700",
      "recommended": "Cake Yeast"
    },
    "salt": {
      "bakers": "3.00",
      "recommended": "Sea Salt"
    },
    "oil": {
      "bakers": "0.00",
      "recommended": "-No Oils Needed"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,17003.0.html",
  "recipe": "<p>THE METHOD OF PRODUCTION OF THE SPECIALITA' TRADITIONALE GARANTITA \"PIZZA NAPOLETANA\"<br/> <br/> Article 1. Name of the product<br/> <br/> The classification of\"Pizza Napoletana STG\" following the Italian tradition and with the wording exclusively in the Italian language, is reserved to the product made using ovens and from businesses dedicated to the production of Pizza, defined as Pizzerias, and destined for the final consumer, with specific features specified as follows:<br/> <br/> The Method<br/> <br/> \"Pizza Napoletana\" is a food preparation made from a base of risen dough and cooked in a wood fire oven. The product is characterized both by the ingredient, means and technologies of production. In the designation \"Pizza Napoletana\" we define the following names: \"Pizza Napoletana Marinara\", \"Pizza Napoletana Margherita Extra\" and \"Pizza Napoletana Margherita\".<br/> <br/> Article 2. Ingredients<br/> <br/> The products that provide the base for \"Pizza Napoletana\" include wheat flour type \"00\" with the addition of flour type \"0\" yeast, natural water, peeled tomatoes and/or fresh cherry tomatoes, marine salt, and extra virgin olive oil.<br/> <br/> Other added ingredients can include, garlic and oregano for \"Pizza Napoletana Marinara\" buffalo milk mozzarella, fresh basil and fresh tomatoes for\"Pizza Napoletana Margherita Extra\" and mozzarella STG or Fior di Latte Appennino and fresh basil for \"Pizza Napoletana Margherita\".<br/> <br/> Article 3. Method of Production.<br/> <br/> The preparation of \"Pizza Napoletana\" includes exclusively the following method of production used in a continuous cycle.<br/> <br/> 1) Preparation of the dough:<br/> <br/> Blend flour, water, salt and yeast. Pour a liter of water into a mixer, dissolve between the 50 and the 55g of salt, add 10% of the total amount of flour, and then add 3g of hydrated yeast. Start the mixer, and then gradually add 1800 g of flour until you achievement of the desired dough consistency. Combining the ingredients should take 10 minutes.<br/> <br/> Next, mix the dough at low speed for 20 minutes, until the dough forms a single ball. To obtain the optimal dough consistency, it is very important to control the quantity of water, such that the flour is able to absorb it all. The mixture should be sticky, soft and elastic to the touch.<br/> <br/> The characteristic\"merceologiche\" of the flour used for \"Pizza Napoletana\" allow it to absorb from 50 to 55% of its weight in water to reach the optimal \"point of pasta.\" The resulting dough can be individualized by the abilities of the individual pizzaiolo.<br/> <br/> The preparation of the dough in the mixer should be done without causing the dough to become warm.<br/> <br/> 2) Dough Rising:<br/> <br/> First phase: remove the dough from the mixer, and place it on a surface in the pizzeria where it can be left to rest for 2 hours, covered from a damp cloth. In this manner the dough's surface cannot become harden, nor can it form a crust from the evaporation of the moisture released from the dough. The dough is left for the 2 hour rising in the form of a ball, which must be made by the pizzaiolo exclusively by hand.<br/> <br/> With the aid of a spatula, cut from the mixture into smaller portions, which are then shaped onto a ball. For \"Pizza Napoletana\" the dough balls must weigh between the 180 and the 250 g.<br/> <br/> Second phase of the dough rising: Once the individual dough balls are formed, they are left in \"rising boxes\" for a second rising, which lasts from 4 to 6 hours. By controlling storage temperature, these dough balls can then be used at any time within the following 6 hours.<br/> <br/> 3) Forming the pizza base:<br/> <br/> Following the second rising, the dough ball can be removed from the rising box using a spatula and placed on the cooking of the pizzeria, on a light layer of flour to keep the dough from sticking to the work bench. With a motion from the center to the outside, and with the pressure of the fingers of both the hands on the dough ball, which is turned over and around multiple times, the pizzaiolo forms a disk of dough that to the center the thickness is not more than 0.3 cm (.11 inch), and a border that is not greater than 1-2 cm (.4-.8 inch), forming a frame, or crust.<br/> <br/> No other type of preparation is acceptable for the preparation of the \"Pizza Napoletana STG.\" Specifically excluded is the use of a rolling pin and mechanical presses. </p> "
}
