{
  "title": "Pepe's New Haven Style Pizza Recipe",
  "oven": "S",
  "style": "A",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "Bread Flour"
    },
    "water": {
      "bakers": "58",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.5300",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "1.87",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "0.00",
      "recommended": "-No Oils Needed"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,26010.msg262301.html#msg262301",
  "recipe": "<p>The instructions on the pizzamaking.com thread cited below call for Full Strength brand flour.  <br/> <br/> Makes 3 17.5\" pizzas:<br/> <br/> Full Strength Flour (100%)907.84 g  |  32.02 oz | 2 lbs<br/> Room Temp Water (58.04%):	526.91 g  |  18.59 oz | 1.16 lbs<br/> IDY (.53%):	4.81 g | 0.17 oz | 0.01 lbs | 1.6 tsp | 0.53 tbsp<br/> Salt (1.87%):	16.98 g | 0.6 oz | 0.04 lbs | 3.04 tsp | 1.01 tbsp<br/> Total (160.44%):1456.53 g | 51.38 oz | 3.21 lbs | TF = 0.0712<br/> Single Ball:	485.51 g | 17.13 oz | 1.07 lbs<br/> <br/> Measure dry (no yeast). Measure wet (+ yeast). Mix wet to dissolve yeast. Dry into wet. Mix, on lowest speed, in a spiral mixer 7 minutes, scraping down sides every few minutes.  Dough consistency should be between cottage cheese and smooth. Scale. Ball and place in lightly oiled dough pans. Refrigerate two days. Remove from fridge 3 hours before baking. Total time between making the dough and baking should be as close as possible to 48 hours. Dough should be just touching the sides of the container after removing from fridge. If not, use more yeast next batch. If it's risen up the container sides, use less yeast.<br/> <br/> Bake on steel plate positioned on the highest oven shelf (4\" from broiler) with a foil wall around the plate tilted at an angle to bounce radiation from the broiler towards the edge for of the pie. Pre-heat plate for 60 minutes at 550.<br/> <br/> Dust wooden peel with 33/33/33 flour/semolina/corn meal<br/> Stretch skin\"<br/> finger press/rim form<br/> edge stretch (this is critical)<br/> knuckle stretch<br/> <br/> to around 18\" (it will spring back a bit) and place on peel<br/> <br/> Quickly dress the pizza, shaking between each topping to make sure the skin doesn't stick<br/> Launch<br/> Wait 1 minute<br/> Turn on broiler<br/> Wait 1 minute<br/> Rotate pizza 180 deg. with metal peel<br/> Crack oven door if broiler shuts off. Broiler should be on for about 80% of the 7-8 minute bake.<br/> Turn every 1.5 minutes, checking bottom color and top.<br/> Retrieve, using metal peel, onto cooling rack<br/> Allow to cool 8 minutes<br/> Transfer to 18\" metal pizza pan<br/> Slice and serve<br/> <br/> Cheese is sliced whole milk Boar's Head but any quality wholesale brick cheese will work. Sauce is ROA1 code tomatoes with a little salt.  As far as I can tell, both the Sclafani's and the Cento Italian tomatoes have this code. Non meat pies get a drizzle of evoo.  Everything gets a liberal dusting of Romano.<br/> <br/> Dialing in the right amount of broiler time will take some trial and error. Also, the 550 preheat direction is for an oven that runs a bit on the cool side.  The steel plate should be around 540 for the bake. If your oven runs hotter, you might want to go with a 525 pre-heat.<br/> </p> "
}
