{
  "title": "Aimless Ryan's Tommy's Style Columbus Thin Crust",
  "oven": "S",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "All Purpose Flour"
    },
    "water": {
      "bakers": "43",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "1.0000",
      "recommended": "Active Dry Yeast"
    },
    "salt": {
      "bakers": "1.50",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "5.00",
      "recommended": "Vegetable shortening"
    },
    "sugar": {
      "bakers": "1.00",
      "recommended": "Sugar"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,12446.msg281349.html#msg281349",
  "recipe": "<p>Aimless Ryan's complete instructions on how to make Tommy's style thin crust pizza.  <br/> <br/> Attention: Rolling this dough takes a lot of hard work. <br/> <br/> So here’s my current best-yet dough formula:<br/> <br/> 100% Pillsbury AP flour<br/> 43% Water<br/> 1.5% ADY<br/> 1.5% Salt<br/> 5% Shortening<br/> 1% Sugar<br/> <br/> To make 44 oz (1,247 g) of dough, which is enough for two 15” pizzas (and will leave you with about 12 oz of scrap dough), use:<br/> <br/> 28.95 oz Pillsbury AP flour<br/> 12.45 oz Water<br/> 0.43 oz ADY (4.34 tsp)<br/> 0.43 oz Salt (2.52 tsp)<br/> 1.45 oz Shortening<br/> 0.29 oz Sugar (2.37 tsp)<br/> <br/> or<br/> <br/> 821 g Pillsbury AP flour<br/> 353 g Water<br/> 12 g ADY<br/> 12 g Salt<br/> 41 g Shortening<br/> 8 g Sugar<br/> <br/> Also, you'll be shooting for a thickness (or TF) of 0.09 oz of dough per square inch. For a 15\" pizza, that means your target skin weight will be 15.9 oz (451 g).<br/> <br/> DO NOT ADD EXTRA WATER TO THE DOUGH. For the laminated texture of the crust to turn out right, this dough needs to be very stiff; stiffer than the dough appears in Tim’s pics. The dough will seem noticeably softer after it ferments, but it will still be very stiff. As long as it’s not hard on your mixer, give your mixer plenty of time to mix the dough. That is, mix it until all the flour is picked up. With the common (tilting head) model of KitchenAid mixer, I don’t know what to expect (because I have a bigger model with a bowl lift and spiral dough hook). If this dough is too hard on your mixer, then I guess you need to get creative and find some kind of mixing trick. (If a dry climate really does make a noticeable difference in the stiffness of the dough, the formula should be adjusted to account for that, rather than adding spoonfuls of extra water to the dough while it's mixing. I feel pretty confident speculating that a dry climate should not necessitate any greater than a 2% hydration increase.)<br/> <br/> I’m still working on figuring out the best way to do a lot of the following stuff because I know there’s a better way than how I’ve been doing it. But here’s how I’ve been doing it lately.<br/> <br/> <br/> Part I: Making the Dough<br/> <br/> Measure the ADY and put it in a custard dish.<br/> Measure the water (100-110 degrees), then pour about 1.5 oz of it into the custard dish.<br/> Add a pinch of sugar to the yeast water and stir well.<br/> Measure the flour and add it to your mixing bowl.<br/> Measure the salt and add it to the mixing bowl.<br/> Measure the sugar and add it to the mixing bowl.<br/> Stir the flour/salt/sugar mixture.<br/> Measure the shortening and add it to the mixing bowl.<br/> When the yeast water is foamy, add it to the mixing bowl.<br/> Add the rest of the water to the mixing bowl.<br/> Mix with a dough hook until there is no loose flour.<br/> Set aside mixer bowl and cover it.<br/> Let the dough bulk ferment for about four hours at room temperature.<br/> Punch down the dough.<br/> Cover and refrigerate the dough overnight.<br/> <br/> <br/> Part II: Managing and Prepping the Dough<br/> <br/> Remove the dough from fridge several hours before you intend to make pizza.<br/> If you’ll be making 15” pizzas, divide the dough into four relatively square 11 oz pieces. (Do not knead, agitate, or round the dough.)<br/> For each pizza you intend to make today, set aside two pieces of dough and cover. (If you only intend to make one pizza, bag and refrigerate all but two of the dough pieces.)<br/> Allow the covered dough to warm up for an hour or two.<br/> <br/> To avoid confusion, I’ll word the remainder of the instructions as if you’ll only be making one pizza. If you plan to make more than one pizza, I think you know how to translate.<br/> <br/> Use your fist to flatten one of the two dough pieces.<br/> Dredge this piece of dough in flour, covering the entire surface of the dough.<br/> Begin rolling the piece of dough, trying to keep it relatively square. (I find that it’s easiest to do this by orienting the dough at a 45-degree angle, like a baseball diamond, so it’s easy to roll the dough equally in every direction.)<br/> When the dough begins sticking to the counter enough that it becomes difficult to roll, add a small amount of bench flour to the top of the dough and spread it around with your hand until the dough does not feel sticky.<br/> Flip the dough over and repeat the previous step.<br/> Continue rolling, as before.<br/> Repeat steps 4-6 until the dough is as thin as you can roll it. It’s very important that you roll it until it is as thin as you can possibly roll it. Try to use only as much bench flour as it takes to keep the dough from being sticky. The dough should end up in the neighborhood of 20” x 20”, if not a little larger.<br/> When you can no longer roll the dough any thinner, dust each side lightly with flour, spreading the flour around with your hand until the dough does not feel sticky.<br/> Fold the dough in half (so it’s a rectangle), then fold it in half the other way, so it’s a square with four layers. (This step is just to make the dough easier to pick up and move out of the way so you can roll the second dough piece.)<br/> Set the folded piece of dough somewhere out of the way and repeat steps 1-8 with the other piece of dough.<br/> <br/> Here’s how to turn the dough into a skin.<br/> <br/> Unfold the dough sheet that you had set aside and place it atop the sheet that's already on your work surface, with both dough sheets oriented the same way.<br/> Fold the stacked sheets of dough in half so the dough takes the form of a rectangle with four layers (like a magazine with a front cover, two pages, and a back cover).<br/> Fold the dough again, lengthwise, so it’s relatively square, with eight layers.<br/> Use a fist to press the dough as much as possible (sorta like a dough press).<br/> Start rolling the dough. (Again, orient it like a baseball diamond.)<br/> As soon as you feel like the eight layers of dough have become what seems to be a single layer of dough, dust each side lightly with flour.<br/> Continue rolling, trying to keep a relatively square shape. You may want to focus largely on rolling the outer perimeter of the dough. Doing this helps me end up with skins of very consistent thickness. You really want to work the corners, too, redistributing some of the corner dough toward the sides. (I know that's hard to understand. I'll try to share a picture eventually, depicting this step.)<br/> Try to use as little bench flour as possible. You want the dough to stick to the counter a little bit, but not too much. Whenever the dough becomes sticky enough to cause wrinkling, dust each side of the dough just enough to keep it from feeling sticky, then continue rolling.<br/> Continue doing this until the dough is larger than a 16” screen or pan. (“16” is not a typo. I’ll explain later.)<br/> When the dough is larger than the pan or screen, use a pizza wheel to trim a 16” skin. (Use the pan or screen as a template.)<br/> Weigh the skin. At this point, the skin will probably be at least a couple ounces heavier than your target skin weight of 15.9 oz (451 g).<br/> Place the skin back on your work surface. (When you do this, the skin’s diameter will probably be at least a few inches smaller than it was when you trimmed it. This is normal, so don’t freak out about it.)<br/> Continue rolling the skin. You probably won’t need to use much (or any) bench flour from this point on.<br/> When the skin gets larger than 16” again, use the pan or screen again as a template to trim the dough.<br/> Weigh the dough. Again, your target weight is 15.9 oz (451 g).<br/> If your skin is still too heavy, continue rolling, trimming, and weighing until your skin is an acceptable weight.<br/> If your skin is within about half an ounce of your target weight, all is good, so put the skin back on your work surface so you can add the final few touches. (The skin probably will have shrunk again, so you’ll need to roll it a little more.)<br/> Without using any bench flour, roll the skin to about 16” again. It should be kinda stuck to the counter.<br/> Leave the slightly oversized 16\" skin alone for 5 or 10 minutes, stuck to the counter so it can relax. By doing this, it should only shrink about an inch once you remove it again from your work surface.<br/> Optional: During the 5 or 10-minute dough rest, dock the skin. (Do not dock the hell out of it. All you want is two side-by-side passes; one just left of center and one just right of center.)<br/> After the rest period, put your skin on a pan or screen and cover with plastic wrap.<br/> Immediately put the pan and skin in the fridge, and leave it there for 2-4 hours.<br/> <br/> Part II-A: Sauce Recipe: <br/> <br/> My sauce for this style is:<br/> <br/> 28 oz Dei Fratelli crushed tomatoes.<br/> 2 tsp oregano<br/> 1/2 tsp basil<br/> 1/2 tsp salt<br/> Optional: Just a little crushed red pepper (even though I don't think Tommy's uses it). Maybe 1/2 tsp.<br/> <br/> Part III: Assembing and Baking the Pizza<br/> <br/> Preheat your oven at 500 with a stone in its normal position for an hour or so before you intend to bake.<br/> About 15 minutes before you intend to bake, remove your skin from the fridge.<br/> Remove plastic wrap from your skin. (You may want to flip the skin upside down on your work surface for about 10 minutes, exposing the bottom side to air, to make it a little drier and easier to peel the topped skin onto your stone.)<br/> Lightly dust a peel with flour.<br/> Place your skin on the peel (with docking marks on the top of the skin if you docked the dough).<br/> Add the amount of sauce that you consider appropriate, distributing the sauce all the way to the edge of the skin. My spreadsheet says to use 9.39 oz (266 g) of sauce, but I’m not sure if that’s very accurate. It’s OK to apply sauce by feel.<br/> Apply 10.89 oz (309 g) of provolone or mozzarella.<br/> If you’ll be making a pepperoni pizza, try 5.68 oz (161 g) of pep. (Ezzo GiAntonio is ideal.)<br/> If you’ll be using other toppings, use a quantity you deem appropriate.<br/> Sprinkle some parmesan or romano cheese on top of the pizza. (Regular grated cheese, like Kraft. None of that horrible \"fancy\" looking shredded stuff. If you use that nasty shredded stuff, I'll kick your ass.)<br/> Peel onto stone.<br/> Set a timer for 8 minutes.<br/> If you’re baking at 500, it’ll probably take at least 8 minutes to bake this pizza, but not more than 10 minutes.<br/> While the pizza is baking, keep a bubble popper handy and keep an eye on the pizza in case you need to use the bubble popper.<br/> After baking for 8-10 minutes (or however long you deem appropriate, pull the pizza from the oven.<br/> Cut into squares of about 2”. For a 15” pizza, you’ll probably want to go 4 cuts x 4 cuts, or possibly 5 x 5. (As you should be able to tell from me and briterian’s actual Tommy’s pics earlier in this thread, the cutting pattern seems to be one of many inconsistencies with Tommy’s pizza.)<br/> Pig out.<br/> <br/> Any questions?</p> "
}
