{
  "title": "Lehman Dough Recipe For An Event",
  "oven": "S",
  "style": "Y",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "Bread Flour"
    },
    "water": {
      "bakers": "58",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.7500",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "2.00",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "2.00",
      "recommended": "Extra Virgin Olive Oil"
    },
    "sugar": {
      "bakers": "1.00",
      "recommended": "Sugar"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,32184.msg318451.html#msg318451",
  "recipe": "<p>This recipe was posted by Tom Lehman in response to a request for a pizza dough meeting the following criteria: <br/> <br/> 1) Can be made using a no-knead method. My Kitchenaid can only do about 1 kilo of flour at a time, and I think I need to make 5x that.<br/> 2) Does a cold rise. Since I am going to be doing this outdoors, I would love to have about half of the dough ready to go at room temp at the start, and the other half cold.<br/> 3) Uses regular flour - either all purpose or bread flour. I don't have easy or cheap access to Caputo 00 or whatever.<br/> 4) Uses instant yeast. I don't have a starter, and I have never used one before. So for this event, I would like to stick with something completely familiar and reliable.<br/> 5) Isn't overly hydrated. It could be really warm, and I need to handle the dough quickly and easily. The less sticking the better.<br/> 5) Works for a 3-minute bake. I want a relatively fast bake, good oven spring, and a crisp undercarriage. People are going to be sitting on the grass and eating, so I don't want the floppiness and moistness of a Neapolitan. Probably something that is a cross of New York and Neapolitan would be ideal.<br/> <br/> Tom's response to this question was as follows:  <br/> <br/> Here's a formula and procedure that we use all the time and it performs just as you have asked.<br/> <br/> Flour: 100% (bread flour)<br/> Salt: 2%<br/> Sugar: 1%<br/> Olive oil: 2%<br/> IDY: 0.75% (hydrate in a small amount of warm (95F) water.<br/> Water: 58% (80F)<br/> <br/> Procedure:<br/> Put water in mixing bowl, add sugar and salt followed by the yeast suspension. Whisk together very briefly. Add the oil and whisk once again immediately followed by the flour. Stir the flour into the liquid until the flour is hydrated, this normally takes a few minutes. Turn out onto a floured bench/counter top, oil a suitably sized bowl/container. Note: A 30-gallon trash container with a food contact approved plastic liner should work well for the formula given below. In this case be sure to oil the dough before dropping it into the lined trash container as this will prevent the dough from sticking to the plastic bag when you go to remove the dough.<br/> Place the dough into the oiled container and drape with a sheet of plastic.<br/> Allow to ferment at room temperature for 2-hours then turn the dough out onto a floured counter top and scale into desired weight pieces.<br/> Form each dough piece into a ball, wipe with salad oil and place into individual plastic bags.<br/> Place all of the dough balls into the fridge to cold ferment overnight.<br/> On the following day transport the dough in a cooler to the event site.<br/> Remove what you will initially need and allow to warm to 50F (about 1-hour for individual size pizzas).<br/> Open dough balls into pizza skins by hand, dress and bake to the order. The dough balls are good for up to 3-hours after they have reached 50F.<br/> Remove remainder of dough as needed and process in the same manner.<br/> To convert percentages into weight measures grab your calculator and follow along;<br/> Enter the weight of flour you want to use (remember that the weight of the ingredient will be shown in the same weight units as the flour weight is expressed in)<br/> After entering the flour weight press \"X\" and then enter the ingredient percent you want to find the weight for, now press the \"%\" key and read the weight in the display. Example: Flour weight is 7-pounds (7 X 16 = 112-ounces) all ingredient weights will now be in ounces.<br/> Salt: 2% (112 X 2 (press the \"%\" key and read 2.24-ounces in the display. Round to 2.25-ounces of salt.<br/> More math fun:<br/> Add up all of the percentages in the dough formula (163.75 for the above formula).<br/> Divide 163.75 by 100 = 1.6375<br/> Decide what the individual dough ball weight will be, lets say 4-ounces each.<br/> Decide how many dough balls you want to make, lets say 60 to be safe.<br/> Yow will need to make at least 60 X 4-ounces or 240-ounces of dough for this order.<br/> To find how much flour you will need to base your dough on simply divide the total dough weight (240-ounces) by 1.6375 = 146.56-ounces (round this up to the next whole unit so it now becomes 147-ounces. You will need to base your dough on a total of 147-ounces of flour.<br/> Salt: 2% 147 X 2 (press the \"%\" key) read 2.94 (call it 3-ounces of salt)<br/> Sugar: 1% 147 X 1 (press the \"%\" key) read 1.47 (call it 1.5-ounces of sugar<br/> Olive oil: 2% 147 X 2 (press the \"%\" key) read 2.94 (call it 3-ounces of oil)<br/> IDY: 0.75% 147 X 0.75 (press the \"%\" key) and read 1.10 (call it 1-ounce of IDY)<br/> Water: 58% 147 X 58 (press the \"%\" key) read 85.26 (call it 85.25-ounces of water or 5.33-pounds of water)<br/> <br/> Good luck with your pizza gig!</p> "
}
