{
  "title": "Tony Gemigiani New York Pizza Dough",
  "oven": "S",
  "style": "Y",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "High-Gluten Flour"
    },
    "water": {
      "bakers": "65",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "1.0000",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "2.00",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "1.00",
      "recommended": "Extra Virgin Olive Oil"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "2.00",
      "recommended": "Diastatic Malt"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php?topic=34967.0",
  "recipe": "<p>Divide the total water in the recipe between 80% ice water and 20% warm water at about 90 F.  In a small bowl combine yeast and the 20% warm water. Mix well until yeast is dissolved. <br/> <br/> Combine flour and diastatic malt in bowl of stand mixer with dough hook.   (You can also just mix by hand in a mixing bowl and skip the electric mixer.) <br/> <br/> Add the remaining 80% of water (the ice water) to the bowl of the mixer, followed by the yeast-water mixture. Mix for about 1 minute until dough begins to come together. Incorporate any remaining bits of flour on the bottom of the bowl. If the dough is not holding together, add a small additional amount of water and mix until the dough holds together.<br/> <br/> Add the salt and mix for 1 minute on low to combine. <br/> <br/> Add the oil and mix for 1 to 2 minutes until all oil is absorbed. Stop the mixer as necessary to pull the dough off the hook. When mixed the dough will still look a bit rough and shaggy.  <br/> <br/> Transfer the dough to an unfloured work surface. A clean counter top is perfect. Knead the dough by hand for 2-3 minutes.  Cover with a damp dish towel and let rest at room temperature for 20 minutes.  <br/> <br/> Using a dough cutter or knife, cut the dough into appropriate sized pieces and form the dough balls.  Set the balls on a half sheet pan, spacing them about 3 inches apart. Cover the pan with a double layer of plastic wrap, sealing well under the pan. Put the pan(s) in a level spot in the refrigerator and refrigerate for 24 to 48 hours.  <br/> <br/> Remove the dough balls from the oven about 4-5 hours before you are ready to make pizzas.  <br/> <br/> The link below is for Tony G.'s pizza dough with starter so the formula is slightly different on the pizzamaking.com website.  <br/> <br/> Diastatic malt is a key ingredient and can be obtained from specialty baking vendors such as Central Milling: http://centralmilling.com/products/tony-gemignanis-low-diastatic-artisan-malt<br/> </p> "
}
