{
  "title": "Emergency Version of Lehmann NY Style",
  "oven": "S",
  "style": "Y",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "High-Gluten Flour"
    },
    "water": {
      "bakers": "63",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.7000",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "1.75",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "1.00",
      "recommended": "Extra Virgin Olive Oil"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,576.msg27251.html#msg27251",
  "recipe": "<p>Water temp adjusted to achieve a finished dough temperature of between 85-90 degree F<br/> <br/> <br/> Measure out the flour by first stirring the flour in the flour container and then repeatedly lifting the flour from the flour container into the measuring cup(s) and leveling off the flour in the measuring cup(s) with a flat edge (this is the \"Textbook\" method)<br/> <br/> A few comments on the formulation are in order. First, since I did not have any bread flour on hand, I weighed an equal amount of King Arthur Sir Lancelot high-gluten flour instead. If you are using bread flour, that will be fine and the amount you will want to use should be close to what I have set forth above. If you have a choice, I would go with the King Arthur brand of bread flour. It is a very high quality bread flour and my favorite among the brands I have tried. Second, I increased the amount of yeast from the levels I usually recommend, from around 0.25% to 0.40%. That was done to compensate for the fact that cold weather is upon us in most parts of the country and one way to compensate for lower kitchen temperatures is to use more yeast (in the summer, I would use 0.25%, or about 1/5 t. in the above formulation). The higher amount of yeast will help the dough to ferment a bit faster and better. Third, I have specified a water temperature of 100 degrees F. That is another way to compensate for lower kitchen temperatures. FYI, 100 degree water, which is what I have specified above, is water that is slightly warm to the touch. If you have a thermometer to measure the temperature of the water, so much the better. (Note: During warmer weather, a lower water temperature should be used. Depending on the part of the country, it might be as low as 50 degrees F, and possibly even lower in really hot climates.) Fourth, I used a thickness factor of 0.105, which is a measure of crust thickness that is characteristic of a NY \"street\" style. This is purely a technical matter for those who wish to control the final crust thickness. Finally, I posted gram weights also. That is for those members who prefer to work in grams rather than ounces.<br/> <br/> Since you are working in volumes, it is important that you measure out the flour as accurately as you can. The way I measure out flour by volume is to start by stirring the flour in the bag of flour to loosen up the flour a bit. I then use a standard tablespoon to scoop flour out of the bag into my measuring cup(s). I don't shake the measuring cup or tamp it. I then level off the top of the measuring cup using a flat edge, such as the flat back edge of a knife. I also level off measuring spoons. When measuring out water, you should check the water level marking on the measuring cup at eye level.<br/> <br/> As for making the dough itself, this is the sequence of steps I recommend you use to practice the recipe posted above: 1) Add the IDY to the flour in a bowl and stir to uniformly disperse the IDY in the flour. 2) Put the water into the bowl of the stand mixer, add the salt, and, using a spoon or spatula, stir for about 30 seconds to a minute to dissolve the salt in the water. 3) Using the stir or 1 speed of the mixer, and with the dough hook attached, gradually add the flour mixture to the water in the bowl. Once the mixer is turned on, I usually use a spatula to help direct the flour/dough into the path of the dough hook so that the flour better incorporates the water. You can use the spatula while the machine is running, if you are careful, or you can stop the machine from time to time to do it. Some people use the paddle attachment for this step and later switch to the dough hook for the more heavy duty kneading. This approach is perfectly fine and, in fact, is my preferred method. The initial mixing/kneading step will usually take a minute or two in a standard home stand mixer. 4) Once the flour has been hydrated (absorbed the water) and a rough dough ball has formed, and with the dough hook attached, add the oil and knead that in, at the 1 speed, until it has been fully incorporated into the dough. Since the amount of dough involved is fairly small (about 3/4 lb.), don't be afraid to stop the mixer from time to time, especially if the oil is not being fully taken up into the dough, and help the dough along by doing some hand kneading to get everything to come together better. Stand mixers are just not that great at kneading small amounts of dough. 5) Once the dough has incorporated the oil, continue kneading the dough, at 1 or 2 speed, until the dough takes on a smooth texture and consistency and is elastic. It should be a bit tacky--not wet or dry. Don't be too concerned about elapsed times. The condition of the dough is more important than the elapsed times. At this point, and especially because you will be working in volumes rather than weight, it may be necessary to add a bit more flour or a bit more water to achieve the desired finished condition. When making such adjustments, I usually add flour or water a half-teaspoon at a time.<br/> <br/> Once the dough looks just about right, remove it from the mixer bowl and knead it by hand for about 30 seconds to a minute. This will give you a good \"feel\" for the dough and allow you to shape it a bit before it goes into the container where it will spend one or more days. If the dough feels a little bit sticky at this point, the final hand kneading will also usually cause the stickiness to disappear, so don't be tempted to overcome it by adding more flour. You should lightly coat the finished dough ball with a bit of oil. The container itself can take many different forms. It can be a normal kitchen bowl (which will have to be covered during fermentation), a zip-type plastic storage bag, a metal container, plastic containers (e.g., Rubbermaid), glass bowls (e.g., Pyrex), or even an empty bread bag with the end twisted and folded under. To get the dough ball to cool down fast and remain cool, one of my favorite storage containers to do this is a metal tin with a tight fitting lid. A zip-type container has the advantage of being compact and requiring little storage space. Whichever form of container you elect to use, it should be placed in the refrigerator, preferably toward the back or near the bottom away from the door. For a Lehmann NY style dough, the time in the refrigerator can range from about 16 hours to up to about 3 days. I have found that one to two days works out well for me.<br/> <br/> When the time comes to make the pizza, you should remove the dough from the refrigerator and set it on your countertop or work surface to warm up. I usually dust the dough with a bit of bench flour and cover it with a sheet of plastic wrap to prevent a skin from forming at the outer surface of the dough. In most cases, it will take about an hour or two for the dough to get to the temperature (around 60 degrees F or higher) where it can be properly shaped and stretched. In the winter, it can take even longer. Conversely, in the summer, it can take less time. For these reasons, I usually take the temperature of the dough to be sure that it is at the proper temperature to safely proceed. If the temperature is too low at the time of shaping, the crust can develop large bubbles and blisters during baking. Some actually prefer this, but professional pizza operators detest it. Once the dough reaches the desired temperature, it can be safely used for 3 to 4 hours thereafter in most cases without overfermenting (a dough made with high-gluten flour will have a somewhat bigger window at this point than one made with a weaker flour). I usually turn on the oven about an hour before I think the dough will be ready to shape and stretch into a dough round (\"skin\"). I put the pizza stone on the lowest oven rack position and let it preheat at the highest oven temperature my oven can deliver (around 500-550 degrees F), for about an hour.<br/> <br/> To shape and stretch the dough in preparation for dressing and baking, I gently flatten the dough using my fingers while avoiding flattening the outer edge which is to become the rim or forcing the gases out of the dough. Once the dough round is around 10 inches in diameter, I lift it and, draping it over my closed fists, stretch it out to its final diameter (12 inches in your case) while \"flicking\" the dough round by one-quarter turns. I often turn the dough over and repeat these steps. I try to work more toward the outer edges so that thin spots don't form near the center. A 12-inch dough round is fairly easy to handle and to toss, so you may want to try doing this once you gain experience and feel comfortable in handling pizza dough. It isn't absolutely necessary to do this, even though is is believed that tossing a dough helps the shaping and stretching of the dough. For those who would like to see a video on how to shape and stretch dough into a dough round.<br/> <br/> Once the dough skin has reached the proper diameter, it should be placed on a peel (I prefer a wood peel) that has been lightly dusted with a bit of flour or semolina (rice flour can also be used). Cornmeal can also be used as a release agent, but it can burn and be messy in the oven, and require periodic cleanings. The pizza can then be dressed. I try to act fast at this stage so that the dough doesn't decide it wants to stick to the peel. So I always line up everything that is to go onto the pizza in advance, from sauce, cheeses, and all the other toppings I intend to use.<br/> <br/> Once the pizza has been dressed and the pizza stone is up to proper temperature, it can be loaded onto the preheated pizza stone by a simple forward jerking action that allows the dressed pizza to slide off of the peel onto the pizza stone. The first few times you do this will have you on edge, but once you master the maneuver, you will be in good shape thereafter (although there will always be a nagging fear that you will not successfully manage the maneuver). The pizza will typically take about 7 minutes to bake, although the exact time will vary from oven to oven. You will therefore have to experiment with oven temperatures and bake times, and even different positioning of your pizza stone, to get the combination that works best for you. In due course, you may even find it helpful to use the broiler element to better balance the baking of the top and bottom of the pizza so that they are done baking at the same time.</p> "
}
