{
  "title": "Apizza Scholls Style Dough",
  "oven": "S",
  "style": "A",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "King Arthur Bread Flour"
    },
    "water": {
      "bakers": "62",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.0400",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "2.00",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "1.00",
      "recommended": "Extra Virgin Olive Oil"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,11994.msg124161.html#msg124161",
  "recipe": "<p>This recipe is based on the fantastic pizza served at Apizza Scholls in Portand Oregon.  Use bread flour for this recipe. (Gold Medal Better For Bread or King Arthur Bread Flour are both fine).  You should have a pizza stone for your oven to make this recipe successfully.  <br/> <br/> This dough makes use of a preferment, or \"poolish\", using a portion of the ingredients listed above. The amount of preferment should be 25% of the flour in the recipe, and an equal amount of water. For example, if your recipe calls for 1,000 grams of flour, use 250 grams of flour and 250 grams of water for the poolish. (Remember to subtract these amounts from the flour and water you add to your final dough!) Mix the preferment water and flour together, and add a very small amount of Instant Dry Yeast (.03% of flour amount, just a tiny bit unless you are making a large batch of dough).  Mix well and leave on the countertop for approximately 12-14 hours. <br/> <br/> After the poolish is ready, mix the dough. Add the poolish and the remaining amounts of flour and water to the bowl of a stand mixer. Mix by hand or on low for just 30 seconds or so to incorporate the water into the flour a bit.  Leave this roughly incorporated mixture to rest for 25 minutes. (This step is called \"autolyse\" and it is said to be one of the keys to great pizza, so don't skip this step.)<br/> <br/> When the autolyse is complete, add the yeast, the salt and the olive oil to the mixer bowl. Mix on low for 2 minutes, then increase the speed to medium for 6 more minutes. At this point the flour will be incorporated, but the dough will not yet be smooth.  Transfer the dough to a large bowl or plastic tub with cover. Allow dough to rise for approximately 3.5 to 4 hours, or until doubled. Do a \"stretch and fold\" on the dough every 45 minutes during bulk fermentation. (You should do approximately 4 stretch and folds during bulk fermentation, which greatly aid in developing the gluten structure of the dough.) To do a stretch and fold, with clean, lightly moistented hands, reach into the bowl, grab the dough from the bottom, and stretch it straight up, then over and back down into the bowl. Repeat this process once or twice more, and that's it.<br/> <br/> When the dough has approximately doubled in size, bulk fermentation is complete. Transfer the dough to a cutting board or clean counter.  Divide, scale and shape into dough balls, and allow to rise for approximately 2.5 hours more at room temperature. Hand stretch the dough balls, top as you like, and make delicious pizza in the style of Apizza Scholls. <br/> <br/> Thanks to Pizzamaking.com members Tannerwood and Pete-zza for their hard work guidance on developing this recipe. A special thanks to Brian Spangler for his generosity in sharing information about how to make his pizza. </p> "
}
