{
  "title": "Pizza Factory Thin Crust Pizza (Garvey)",
  "oven": "S",
  "style": "A",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "All Purpose Flour"
    },
    "water": {
      "bakers": "50",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.5000",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "1.00",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "8.00",
      "recommended": "Vegetable Oil"
    },
    "sugar": {
      "bakers": "1.00",
      "recommended": "Refined Granulated Sugar"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,17662.msg171264.html#msg171264",
  "recipe": "<p>I. DOUGH<br/> <br/> For each 14\" pie, you'll need a 300 g dough ball.  Here is the recipe for two (because who in their right mind would make only one pizza? ;-))<br/> <br/> AP Flour (100%):<br/> Water (50%):<br/> IDY (.5%):<br/> Salt (1%):<br/> Oil (8%):<br/> Sugar (1%):<br/> Total (160.5%):<br/> Single Ball:<br/> 373.83 g  |  13.19 oz | 0.82 lbs<br/> 186.92 g  |  6.59 oz | 0.41 lbs<br/> 1.87 g | 0.07 oz | 0 lbs | 0.62 tsp | 0.21 tbsp<br/> 3.74 g | 0.13 oz | 0.01 lbs | 0.67 tsp | 0.22 tbsp<br/> 29.91 g | 1.05 oz | 0.07 lbs | 6.65 tsp | 2.22 tbsp<br/> 3.74 g | 0.13 oz | 0.01 lbs | 0.94 tsp | 0.31 tbsp<br/> 600 g | 21.16 oz | 1.32 lbs | TF = .06875<br/> 300 g | 10.58 oz | 0.66 lbs | TF = .06875<br/> <br/> Make dough 48-72 hrs ahead (absolute minimum is 24 hrs.; my personal preference is 72; still great after 96 hrs), kept in fridge until a couple hrs before baking.  Punch down as needed during the first 12-24 hrs.  I like to separate out the dough balls after the first 24 hrs. of rising as one mass.<br/> <br/> When making the dough, dump all the dry ingredients into the mixer bowl, stir to combine, and then add the liquids.  Mix until it the dough comes together, and then let it sit for 20 minutes, covered, to hydrate.  Resume with kneading until windowpane stage (5-10 mins).<br/> <br/> II. SAUCE<br/> <br/> Most recipes on this site fail to give sauce recipes.  Well, you're in luck.  Here's mine. Makes enough for two pizzas (or maybe a little more than two, depending on your preferences).<br/> <br/> 12 oz. can Contadina tomato paste<br/> 3/4 c. water<br/> 1/2 tsp. salt<br/> 1/2 tsp. black pepper<br/> 1/4 tsp. onion powder<br/> 1/8 tsp. garlic powder<br/> 1 tsp. thyme<br/> 1/2 tsp. basil<br/> 3/4 tsp. oregano<br/> 1 1/4 tsp. marjoram<br/> 1 tsp. fennel seed<br/> 1/2 tsp. McCormick Italian Seasoning<br/> 3 dashes paprika<br/> 1/2 tsp. sugar<br/> <br/> Mix all ingredients together in a small or medium sized bowl, making sure to crush the leaves and seeds between your fingers as you add them, so that the essences of the spices are released into the sauce.  Mix well. <br/> <br/> Make sauce on day of baking and leave at room temp.  (If made too far ahead and refrigerated, the cold plus all the dried leaf herbs thicken the paste too much so that you will have to mix some water back in to get it to spreadable again.)<br/> <br/> [NOTE ABOUT SPICES: Use dried spices, and use spices that are in the form of dried leaves, not the pulverized, \"ground\" varieties, except for salt, pepper, and the garlic and onion powders.]<br/> <br/> OK, I admit that this may seem fussy with so many specific herbs and spices listed and even brand names.  Trust me: try it this way.  BTW, many Southside joints use tomato paste as the base, so I'm surprised more folks don't talk about that here.  And for whatever reason, Contadina is the best paste for this particular recipe.  Hunts and others just don't work nearly as well.  And since this is a saucy pie, there is a big difference.<br/> <br/> III. ASSEMBLY<br/> <br/> Roll out your 300 g dough ball to 14\", which is just under the size of a typical pizza stone. The pizza will cook directly on the stone--no cutter pan or screen or anything. (I have lately been assembling on foil on the peel, just because I'm lazy and that's easier and less messy to slide onto the stone than cornmeal. Do whatever way you like, but you should not pan the pizza.)<br/> <br/> Top with sauce.  I like to go pretty heavy.<br/> <br/> Add sausage (ideally), raw and flattened out a bit, or however you like it.<br/> <br/> Add any veggies or other toppings.<br/> <br/> Top with about 6 oz (by weight) of shredded mozz; if you really want more, that's fine, but don't put more than 8 oz. (if you are using pre-shredded stuff, it's about 1 1/2 c to make 6 oz by weight)<br/> <br/> IV. BAKING<br/> <br/> Preheat a baking stone to 500° for one hour and reduce to 450° before putting in the pie.  (I like putting my stone on an upper rack, but you know your oven and local conditions better than I do.  I only know my oven.)<br/> <br/> Carefully slide the assembled pizza onto the hot baking stone.  Bake at 450° for about 10 minutes (or 9-13 minutes, depending on your oven and your desired doneness).<br/> <br/> When the cheese starts to brown and the crust looks golden, remove from oven and let stand on a cooling rack for 6-7 minutes before cutting.  [NOTE: The cooling rack is a key step, since it lets air under the crust to cool it and allow steam to escape; otherwise, if left on a pan, the crust will soften and no longer have that the desired texture on the bottom.  If you do not have a cooling rack, jury rig something.  At the very least, you can cool the pizza on cheap, non-waxy paper plates, which I have used with some success, since they are porous.] <br/> <br/> Of course, you'll need to slide it back onto a pan for cutting, which you see pictured in my profile and below.<br/> <br/> \"Party cut\" only!  The square party-cut style is mandatory--never the more barbaric pie-cut. <br/> <br/> And then…<br/> YOU'RE EATING PIZZA FACTORY!<br/> <br/> </p> "
}
