{
  "title": "Scott123 New York Pizza",
  "oven": "S",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "High-Gluten Flour"
    },
    "water": {
      "bakers": "63",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.5600",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "1.75",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "2.00",
      "recommended": "Vegetable Oil"
    },
    "sugar": {
      "bakers": "1.00",
      "recommended": "Sugar"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,20732.msg206639.html#msg206639",
  "recipe": "<p>Notes: <br/> Flour prescribed is Spring King Flour (bleached bromated 13.2% protein) <br/> Water should be hard tap water at 68F<br/> Salt should be non-iodinized<br/> <br/> <div class=\"inner\" id=\"msg_206639\">Brian, I'm always a little reticent to post recipes, because the protein content/brand of flour will dictate the necessary hydration, and everyone's environmental variables will dictate the yeast quantity. My recipes are also heavily geared towards the equipment I use and my personal skills.  Once you start trying to compensate for other flours and for varying equipment, it can be especially difficult.<br/><br/>That being said, here's where I'm at. I pulled this recipe from an older recipe I posted a while back that was directed towards a beginner.  Since it's here, I'm leaving it, but Brian, you can ignore the beginner's tips at the bottom.<br/><br/>For three 17\" skins:<br/><br/>Spring King Flour (bleached bromated 13.2% protein)   855g (100%)   <br/>Tap (hard) water room temp (68 deg.)   544g (63.6%)<br/>IDY   1.5 t. (0.56%)<br/>Salt (Great Value brand non Iodide)   15g (1.75%)<br/>Soybean oil   25g (2.98%)<br/>Sugar   9g   1.05%<br/><br/>Measure dry (no yeast). Measure wet (+ yeast). Mix to dissolve yeast. Dry into wet. Stir with a metal spoon until it's too stiff to stir, then knead, by hand, until very well mixed, but no further (3-4 minutes total).  Dough should be somewhere between cottage cheese-y and smooth. (Window paning is too far). Scale. Ball and place in <a href=\"https://web.archive.org/web/20201112002357/http://www.bakedeco.com/a/plastic-dough-pan-s-12232.htm#.UECvU2roozM\" class=\"bbc_link\" target=\"_blank\"><span class=\"bbc_u\">dough pans</span></a>. Refrigerate 1 day. Re-ball and return to lightly oiled pan. Refrigerate 1 more day.  Remove from fridge 3 hours before baking (shorter if containers are thin and less insulating).<br/><br/>Bake on 1/2\" x 17\" x 17\" steel plate (or larger if your oven can fit it). Pre-heat plate for 60 minutes at 515.  Plate should be positioned on an oven shelf that's about 7\" from the broiler.<br/><br/>Dust <a href=\"https://web.archive.org/web/20201112002357/http://www.wasserstrom.com/restaurant-supplies-equipment/Product_106935\" class=\"bbc_link\" target=\"_blank\"><span class=\"bbc_u\">wooden peel</span></a> with 50/50 flour/semolina<br/>Stretch skin to 17\" and place on peel<br/>Quickly dress the pizza, shaking between each topping to make sure the skin doesn't stick<br/>Launch <br/>Wait 1.25 minutes<br/>Turn on broiler<br/>Wait 1 minute<br/>Rotate pizza 180 deg. with <a href=\"https://web.archive.org/web/20201112002357/http://www.amazon.com/gp/product/B003E22RS4/ref=oh_details_o01_s00_i01\" class=\"bbc_link\" target=\"_blank\"><span class=\"bbc_u\">metal peel</span></a><br/>Wait .75 minute, watching for cheese to bubble and darken<br/>Retrieve onto cooling rack<br/>Allow to cool 10 minutes<br/>Transfer to 18\" metal pizza pan<br/>Slice and serve<br/><br/>On a 17\" pie, I put 7 ounces of sauce and 11 ounces of whole milk low moisture brick mozzarella.  If the sauce is the right consistency (on the thick side), the cheese won't slide too much, but if the sauce is thin, the cheese will have a tendency to migrate and boil over the rim.  Even with relatively thick sauce, keep the cheese away from the outer 2\" of the skin (sauce to 1\", cheese to 2\").<br/><br/>My tap water has a lot of chlorine, so I have to boil it and then let it cool first.  I've tried bottled water, but I find tap gives me a little better oven spring.<br/><br/>The yeast quantity is going to be a rough ballpark. This dough is like clockwork for me and ferments in 2 days.  With your yeast, fridge temp, flour age, water, etc., it could be 1 day or even 3.  You're going to want to shoot for a doubling of the dough, but what's really critical is how the underside of the dough looks.  Ideally, if you have a large wide round clear proofing container, you can take photos of the underside and post them here.<br/><br/>If you've never opened a pizza skin before, you'll have a really hard time stretching this to 17\". Stretching skills are something that neither a book nor this forum can help you master.  You just have to do it over and over again. Here's a video to get you started (ignore the rolling pin stuff and the tossing- my dough is too extensible to toss).<br/><br/><br/> <table class=\"maeva\" cellpadding=\"0\" cellspacing=\"0\" border=\"0\" style=\"width: 480px\" id=\"sae1\"><br/> <tr><td style=\"width: 480px; height: 385px\" id=\"saeva1\"><script type=\"text/javascript\"><!-- // --><![CDATA[<br /> var oldLoad = window.onload;<br /> window.onload = function() { if (typeof(oldLoad) == \"function\") oldLoad(); if (typeof(aevacopy) == \"function\") aevacopy(); }<br /> // ]]></script><embed type=\"application/x-shockwave-flash\" src=\"https://web.archive.org/web/20201112002357oe_/http://www.youtube.com/v/SjYqw1CLZsA&amp;rel=0&amp;fs=1&amp;hd=1&amp;showinfo=0\" width=\"480px\" height=\"385px\" wmode=\"transparent\" quality=\"high\" allowfullscreen=\"true\" allowscriptaccess=\"never\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" autoplay=\"false\" autostart=\"false\"/><noembed><a href=\"https://web.archive.org/web/20201112002357/http://www.youtube.com/watch?v=SjYqw1CLZsA\" target=\"_blank\" class=\"aeva_link bbc_link new_win\">http://www.youtube.com/watch?v=SjYqw1CLZsA</a></noembed></td></tr></table><br/><br/>Launching skins off a peel is another area where practice is essential.  The nice thing about launching, though, is that you can launch the undressed skin onto the counter, put it back on the peel and launch it again, repeating it over and over.<br/><br/>Spring King flour can be hard to find.  If you have trouble, you can use bromated All Trumps and blend it with 33% all purpose.  In order to make a 'true' NY slice, though, you're going to want to track down bromated flour. Full Strength should be substitutable for Spring King, possibly with a slight reduction in water (I'd give 62% a shot).<br/><br/>Also, for anyone interested, I'll be changing this within the next 6 months to do a room temp bulk, rather than the re-ball.  Right now, when I take the partially fermented dough balls out of the containers to re-ball, the containers are a bit gummy, and it's kind of a hassle to wipe them out. If I bulk, I save myself this trouble.  It's just a matter of dialing in the right amount of yeast for a room temp bulk and deciding on a time frame.</div><br/> </div><br/> </div></p> "
}
