{
  "title": "Jackie Tran Pizza Dough",
  "oven": "S",
  "style": "A",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "Caputo 00 Pizzeria"
    },
    "water": {
      "bakers": "67",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.3000",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "2.50",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "0.00",
      "recommended": "-No Oils Needed"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,14201.msg142335.html#msg142335",
  "recipe": "<p>This is a two day cold fermented dough developed by Jackie Tran, aka Chao.  Note that this recipe uses a mixture of 60% Italian 00 flour and 40% high gluten flour.  <br/> <br/> <b>Ingredients</b><br/> Flour 100%  (60/40 00/High Gluten blend)<br/> Water 67%  (Those interested in using this recipe may want to decrease the hydration to 63% or so)<br/> IDY 0.3%<br/> Salt 2.5%<br/> <br/> Sometime in the evening...<br/> <br/> Method:  Measure out ingredients.<br/> -dissolve salt in room temperature bottled water.  Dump yeast into water.<br/> -Measure out flour and mix the dry flours well in a Ziploc bag or bowl before adding to water.<br/> -Dump all of the flour into the liquid.  Stir with fork or spoon until shag.  Then with both hands squeeze dough vigorously until you get a fairly even mix.  Should look similar to cottage cheese.<br/> -Cover and let it rest for 20-30m.  Can rest longer if using cold water.  If using warm water cut the rest time down.  You don't want the yeast becoming too active.<br/> -After the rest period, do a few stretch &amp; foldsand knead by hand with the palms for about 1 minute.  <br/> -cover and rest for 5-10 minutes, then fold and knead again for about 30 seconds.  You can vary these times to see what results you get.<br/> -Ball up the dough and place into a very lightly oiled container and straight into the fridge (40-50F)<br/> <br/> The next moring....<br/> -dump the dough out cold, divide and ball.  The dough should have risen 25-50%.  <br/> -put balls into individual lightly oiled containers or proofing tray and then back into the fridge.<br/> <br/> About 2-3 hours before baking, place dough on counter at room temps.   Aim for a 4-5 minute bake at 650F or so.  <br/> </p> "
}
