{
  "title": "TXCraig's Mozza Inspired Pizza Dough",
  "oven": "S",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "AP Flour 98%, Spelt  2%"
    },
    "water": {
      "bakers": "75",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.1500",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "2.25",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "0.00",
      "recommended": "-No Oils Needed"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "2.00",
      "recommended": "Barley Malt Syrup"
    }
  },
  "url": "https://www.pizzamaking.com/forum/index.php?topic=36346.0",
  "recipe": "<p>A mixture of 98% King Arthur All Purpose Flour and 2% spelt flour is recommended for this recipe.  <br/> <br/> Preferment 40% of the All Purpose flour with an equal amount of water (100% hydration) along with all of the yeast for 12 hours.<br/> <br/> Dissolve the total formula salt in the remaining water. Add in the preferment and mix well. Add in the spelt and the remaining AP flour in a half dozen or so increments while mixing at a slow speed in an electric mixer. Mix time should be approximately 4-5 minutes.  The goal is to incorporate air with the flour. After the ingredients are well mixed, remove dough from the mixer and let it rest for 20 minutes.  Then give it a set of stretch-and-folds. Try to capture air in the dough when you fold. Give the dough a 12 minute rest followed by another set of stretch-and-folds. Rest for 12 minutes and repeat stretch-and-folds one more time.<br/> <br/> Divide, ball and refrigerate for 24 to 48 hours (48 would be better). Give the balls at least 2 hours at room temperature before opening. When opening the dough ball preserve the outer rim for a puffy edge. Prior to baking, coat the edge with olive or avocado oil.  Top as desired and bake on a well heated baking stone at 550F. If you have convection setting in your oven, use it. <br/> <br/> For more information about this recipe including photos, see the link below.   <br/> <br/> <br/> </p> "
}
