{
  "title": "Pizza Shark's Authentic New York Style",
  "oven": "S",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "All Purpose Flour"
    },
    "water": {
      "bakers": "66",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "0.4500",
      "recommended": "Active Dry Yeast"
    },
    "salt": {
      "bakers": "1.82",
      "recommended": "Salt"
    },
    "oil": {
      "bakers": "2.00",
      "recommended": "-No Oils Needed"
    },
    "sugar": {
      "bakers": "0.00",
      "recommended": "-No Sugar Needed"
    },
    "other": {
      "bakers": "2.00",
      "recommended": "Honey"
    }
  },
  "url": "http://www.pizzamaking.com/forum/index.php/topic,3736.msg31160.html#msg31160.",
  "recipe": "<p>Swish hot water around in your mixing bowl and your measuring cup to pre-heat them (it does no good to pour 115 degree water into a cold mixing bowl that immediately drops it to 95 degrees).  Measure your water in the heated measuring cup and pour it in the heated mixing bowl followed by the honey &amp; yeast (no salt yet as it fights the yeast).  Stir until mixed and let stand until foamy (about 10 minutes).  Mix your flour &amp; salt together in a separate container.  Add 1 tbs of oil to the foamy mixture and follow with 3 cups of the flour/salt mixture.  Turn on to speed #2 for 3 minutes.  Then, begin gradually adding flour mixture at 1/4 cup amounts every 30 seconds or so until the dough begins to cling to the hook instead of the sides.  Don't be afraid to quickly shove a rubber spatula in there to assist this process.  Continue adding flour until the dough no longer sticks to sides and no longer forms a pool of wet dough on the bottom of bowl.  Don't worry about \"Over Kneeding\".  You can kneed NY style dough for 25 minutes and it won't hurt it.  You can't really over kneed NY pizza dough because it is a very moist dough.  You can only over-kneed dry doughs.  Once it is clinging to the hook and the bottom is clean while mixing continue for another 5 minutes or until it appears SMOOTH and has a nice SHEEN to it.  After 5 minutes, shut her down and stick your finger into it for 5 seconds... This is the test... You should be able to remove your finger after 5 seconds \"relatively\" clean.  See photos.  Now stick it in for 10 seconds, the dough after 10 seconds will probably stick all over your finger.  That is the ultimate dough.  Won't stick to you as it is tossed quickly, yet loaded with moisture that can be burned off in the high temp bake to result in a highly crisp crust yet melt-in-ur-mouth hot bread-like interior.<br/> <br/> Once you are there, THE LAW IS THIS...  RAW FLOUR AFTER THIS POINT IS YOUR DOUGH's WORST ENEMY.  Any time this dough touches raw flour after this point you are degrading it.  Raw flour after this point is not cooked... it just sticks to the dough, forms a chalk-like film on the dough, reduces browning, etc, etc.  Lightly oil your hands (don't flour them) and divide into 3 dough balls.  You now roll the balls in your oiled hands (now there's an idea ladies) rub them with oil so they don't get dry, get crusty and crack during the rise.  Place in a lightly oiled container, cover and let rise until 50% to 100% bulk rise is achieved.  You can do this at room temperature or you could have pre-heated your oven at 250 for a few minutes and then shut it off and place them inside for a faster rise.<br/> <br/> After the rise, press the balls down (there's another idea) as shown in the photos. Now cover again and place in the fridge for an hour to condition.  (Now is when you fire up the oven with the stones in it at 550).  After an hour, remove the dough from the fridge, uncover and allow to come to room temp.  Secret here... If you like bubbles, stretch the dough cold before it comes to room temperature.  If you don't like bubble's allow to come to room temperature.  Why?  As I stated to Mr. know-it-all here who called me Pappa John or something, yeast has EVERYTHING to do with oven spring... IT IS NOT WATER VAPOR OR STEAM that causes dough to \"SPRING\".  It is yeast and their last fight to survive before they are incinerated.  As the temp in the dough hits their sweet spot, they start rockin' and rollin' without a clue that it is gonna get one heck of alot hotter.  Cold dough allows for a longer temp in their \"sweet spot\" for them to keep on rockin' &amp; rollin' after the pie is placed in the oven.  Room temp dough cuts their rock-n-roll time back so they don't have the time to give ya those big crusty bubbles.  Learning anything here?<br/> <br/> Your peel needs to be treated. Take soem flour and toss it on your peel.  Rub it in and then SCRAPE IT ALL OFF.  You only want to fill the little microscopic voids in the peel and use the flour to DRY it.  Now take your semolina flour...  WHICH YOU MUST HAVE.  Don't use corn meal and such.  Find semoliona flour and lightly dust your peel so it looks like a light snow dusting.  Corn mean contains corn oil and will burn while it imparts a corney flavor to your dough.     <br/> <br/> Getting ready for the stretch... DO NOT THROW A LOAD OF FLOUR ON YOUR PREP SURFACE AND THEN THROW YOUR DOUGH BALL ON IN.  What did I say? FLOUR IS YOUR DOUGH's ENEMY AS SOON AS IT LEAVES THE MIXING BOWL.  LIGHTLY flour your surface and YOUR HANDS.  Now is when you flour the hands.  Remember when we oiled them earlier for the separation?  Now we flour them.  We want flour on the hands to minimize flour on the dough and oiled hands at this point just don't work with tossing and stretching.  Remember when we placed our plain finger in the dough and it sticked a little bit after 5 seconds?  Now that we have floured fingers it won't stick cause we aren't going to hold any part more than 5 seconds.   Spread the dough to an 8\" circle on your prep surface.  Pick it up and begin stretching.  Stretching is an art that I can't describe but you'll get it with time.  Just think FISTS and no fingers.  If you have to use fingers you can hold the edges and allow the dough to drape on your prep area as you move your way around it like a clock.  It will be just fine.  Remember, you can't really be too thin but you can be too thick.  What looks like a thin membrane that you can almost see through will puff and cook to be a crispy 1/8th inch.<br/> <br/> </p> "
}
