{
  "title": "DKM Thin Crust (Cracker Style)",
  "oven": "S",
  "style": "A",
  "ingredients": {
    "flour": {
      "bakers": "100",
      "recommended": "King Arthur Bread Flour"
    },
    "water": {
      "bakers": "40",
      "recommended": "Water"
    },
    "yeast": {
      "bakers": "1.0000",
      "recommended": "Instant Dry Yeast"
    },
    "salt": {
      "bakers": "1.50",
      "recommended": "Sea Salt"
    },
    "oil": {
      "bakers": "3.00",
      "recommended": "Extra Virgin Olive Oil"
    },
    "sugar": {
      "bakers": "1.00",
      "recommended": "Refined Granulated Sugar"
    },
    "other": {
      "bakers": "0.00",
      "recommended": "-No Others Needed"
    }
  },
  "url": "http://www.pizzamaking.com/thincrust.php",
  "recipe": "<p>In a heavy-duty stand mixer (e.g., KitchenAid) fitted with dough hook, add the water, oil, yeast, salt, and sugar. Mix thoroughly until yeast has fully dissolved. Add flour and mix on low speed until all of the flour and water have mixed and a stiff dough ball forms, about 3 to 4 minutes. Stop mixing as soon as the dough ball forms as this type of dough should not be kneaded.<br/> <br/> <br/> Place the dough ball into a large bowl and cover tightly with plastic wrap. Let the dough rise for 24 hours in the refrigerator before using. Please note that I cannot over-emphasize the importance of a 24-hour rising time since it is absolutely essential for the dough to develop its signature texture and, more importantly, its unique flavor! Do not skip this step!<br/> <br/> Preheat your oven to 500 °F about one hour before you plan to bake the pizza.<br/> <br/> Turn the dough out onto a large surface and dust with flour. Using a heavy rolling pin (or dough sheeter), roll the dough out very thin to form a 24-inch or larger circle. If you're using a cutter pizza pan (recommended), dust the pan lightly with flour, place the dough in the pan and dock. Use the rolling pin to trim off the excess dough drooping over the sides of the pan. If you wish to cook the pizza directly on a pizza stone (not using a pan), then place the dough on a dusted pizza-peel, dock, and fold the edge over 1-inch all the way around and pinch it up to form a raised lip or rim.<br/> <br/> Optionally, pre-cook the crust for 4 minutes before adding any sauce or toppings. Remove the crust from the oven and pop any large air pockets that may have formed. Add the sauce, shredded mozzarella cheese, and your favorite toppings. Continue baking, on the lowest oven rack, rotating the pan half way through so that it cooks evenly, until crust is sufficiently browned and crisp, about 10 to 15 minutes. Remove the pizza from the oven and slide pizza out of cooking pan onto a large wire cooling rack or cutting board. Allow to cool for 5 minutes before transferring to a serving pan. This step allows the crust to stay crisp while it cools, otherwise the trapped steam will soften the crust.<br/> <br/> Once cool, use a pizza cutter to slice the pie into pieces and enjoy!<br/> <br/> </p> "
}
